In [2]:
%load_ext sql
import pandas as pd
import sqlite3

In [3]:
%sql sqlite:///CourseData.db

'Connected: @CourseData.db'

The below queries are simply to test the data integrity of the 'Courses', 'Professors', 'Course_meetings', 'Programs' tables.

In [4]:
%%sql
SELECT *
FROM COURSES AS C1 LIMIT 2;

 * sqlite:///CourseData.db
Done.

[(1, None, '70384', 'AC 0011', 'Fall2014', 'C01', '1', 0, 31, -31),
 (2, None, '70385', 'AC 0011', 'Fall2014', 'C02', '1', 0, 31, -31)]

In [5]:
%%sql
SELECT *
FROM PROFESSORS AS C1 LIMIT 2;

 * sqlite:///CourseData.db
Done.

[(1, 'Michael P.  Coyne'), (2, 'Rebecca I.  Bloch')]

In [ ]:
%%sql
SELECT * FROM COURSE_MEETINGS
LIMIT 10;

In [ ]:
%%sql
SELECT * FROM PROGRAMS;

In [14]:
%%sql
SELECT *
FROM COURSE_CATALOG
LIMIT 2;

 * sqlite:///CourseData.db
Done.

[(1, 'AN 0301', '2017_2018', 4, 'Independent Study', '1-3 Credits', None, None, None, None, 'Students undertake an individualized program of study in consultation with a director from the Asian studies faculty.'),
 (2, 'AN 0310', '2017_2018', 4, 'Asian Studies Seminar', '3 Credits', None, None, None, None, 'This seminar examines selected topics concerning Asia. This course is taught in conjunction with another 100-300 level course from a rotation of cour ... (412 characters truncated) ... e term paper in substitution of some portion of the conjoined course requirements, as determined by the instructor. Open to juniors and seniors only.')]

The below code is intended to aggregate the total cap, act, and rem grouped by professor

In [9]:
%%sql
SELECT DISTINCT professor_id, SUM(cap), SUM(act), SUM(rem)
FROM COURSES
GROUP BY (professor_id) LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(None, 1291, 944, 1353),
 ('1', 561, 731, -170),
 ('10', 413, 351, 62),
 ('100', 104, 108, -4),
 ('1000', 196, 185, 11),
 ('1001', 17, 12, 5),
 ('1002', 20, 16, 4),
 ('1003', 25, 24, 1),
 ('1004', 16, 16, 0),
 ('1005', 25, 25, 0)]

### Historical Overcap professors

In [10]:
%%sql
SELECT DISTINCT professor_id, cap, act, rem
FROM COURSES
WHERE rem < 0 AND cap > 0
GROUP BY professor_id LIMIT 2;

 * sqlite:///CourseData.db
Done.

[(None, 10, 11, -1), ('1', 28, 31, -3)]

 * sqlite:///CourseData.db
Done.

[(1, 1, 'DSB 105', 'T', '2014-09-02T08:00:00', '2014-09-02T09:15:00'),
 (2, 1, 'DSB 105', 'F', '2014-09-05T08:00:00', '2014-09-05T09:15:00'),
 (3, 1, 'DSB 105', 'T', '2014-09-09T08:00:00', '2014-09-09T09:15:00'),
 (4, 1, 'DSB 105', 'F', '2014-09-12T08:00:00', '2014-09-12T09:15:00'),
 (5, 1, 'DSB 105', 'T', '2014-09-16T08:00:00', '2014-09-16T09:15:00'),
 (6, 1, 'DSB 105', 'F', '2014-09-19T08:00:00', '2014-09-19T09:15:00'),
 (7, 1, 'DSB 105', 'T', '2014-09-23T08:00:00', '2014-09-23T09:15:00'),
 (8, 1, 'DSB 105', 'F', '2014-09-26T08:00:00', '2014-09-26T09:15:00'),
 (9, 1, 'DSB 105', 'T', '2014-09-30T08:00:00', '2014-09-30T09:15:00'),
 (10, 1, 'DSB 105', 'F', '2014-10-03T08:00:00', '2014-10-03T09:15:00')]

### over/under capacaty courses

In [11]:
%%sql
SELECT DISTINCT course_title, rem, prereqs, catalog_year
FROM COURSE_CATALOG CC
JOIN COURSES C1
USING (catalog_id)
WHERE rem < 0 AND cap >0 LIMIT 10;

 * sqlite:///CourseData.db
Done.

[('Introduction to Financial Accounting', -1, None, '2017_2018'),
 ('Introduction to Financial Accounting', -1, None, '2018_2019'),
 ('Introduction to Financial Accounting', -2, None, '2017_2018'),
 ('Introduction to Financial Accounting', -2, None, '2018_2019'),
 ('Introduction to Financial Accounting', -3, None, '2017_2018'),
 ('Introduction to Financial Accounting', -3, None, '2018_2019'),
 ('Introduction to Financial Accounting', -4, None, '2017_2018'),
 ('Introduction to Financial Accounting', -4, None, '2018_2019'),
 ('Intermediate Accounting II', -2, 'AC 0203.', '2017_2018'),
 ('Intermediate Accounting II', -2, 'AC 0203.', '2018_2019')]

### Number of students over years
3 joins for that courses, course meetings, and course catalogs

In [13]:
%%sql
SELECT DISTINCT course_title, rem, prereqs, catalog_year
FROM COURSE_CATALOG
JOIN COURSES C1
USING (catalog_id)
WHERE rem < 0 AND cap >0 LIMIT 10;

 * sqlite:///CourseData.db
Done.

[('Accounting Information Systems', -4, 'AC 0012.', '2017_2018'),
 ('Accounting Information Systems', -4, 'AC 0012.', '2018_2019'),
 ('Advanced Accounting', -2, 'AC 0204; junior or senior standing.', '2017_2018'),
 ('Advanced Accounting', -2, 'AC 0204; junior or senior standing.', '2018_2019'),
 ('Auditing', -1, 'AC 0204; junior or senior standing.', '2017_2018'),
 ('Auditing', -1, 'AC 0204; junior or senior standing.', '2018_2019'),
 ('Federal Income Taxation I', -2, 'AC 0204; junior or senior standing.', '2017_2018'),
 ('Federal Income Taxation I', -2, 'AC 0204; junior or senior standing.', '2018_2019'),
 ('Introduction to Four-Field Anthropology', -1, None, '2017_2018'),
 ('Introduction to Four-Field Anthropology', -1, None, '2018_2019')]

### Are courses that have prereqs more overcapacity?

In [12]:
%%sql
SELECT DISTINCT course_title, cap, act, rem, prereqs
FROM COURSE_CATALOG CC
JOIN COURSES C1
USING (catalog_id)
WHERE rem < 0  AND prereqs != 'None' LIMIT 10;

 * sqlite:///CourseData.db
Done.

[('Legal Environment of Business', 0, 21, -21, 'Junior standing.'),
 ('Legal Environment of Business', 0, 23, -23, 'Junior standing.'),
 ('Legal Environment of Business', 0, 24, -24, 'Junior standing.'),
 ('Legal Environment of Business', 0, 25, -25, 'Junior standing.'),
 ('Legal Environment of Business', 0, 26, -26, 'Junior standing.'),
 ('Legal Environment of Business', 0, 27, -27, 'Junior standing.'),
 ('Legal Environment of Business', 0, 28, -28, 'Junior standing.'),
 ('Legal Environment of Business', 0, 30, -30, 'Junior standing.'),
 ('Legal Environment of Business', 15, 16, -1, 'Junior standing.'),
 ('Legal Environment of Business', 20, 21, -1, 'Junior standing.')]